packages/purchase/test/provider/fixtures/generated/stripe/checkout.session.completed.json

{
  "payload": "{\n  \"id\": \"evt_1TOc1DJzxxJFDrzxQZUWkxq1\",\n  \"object\": \"event\",\n  \"api_version\": \"2026-03-25.dahlia\",\n  \"created\": 1776769143,\n  \"data\": {\n    \"object\": {\n      \"id\": \"cs_test_a1sXoGnkfUziTSIoh3PRhBX4NFKEtHPpqWRQI4TzX3zStRTNDDxLA0qLrj\",\n      \"object\": \"checkout.session\",\n      \"adaptive_pricing\": {\n        \"enabled\": true\n      },\n      \"after_expiration\": null,\n      \"allow_promotion_codes\": null,\n      \"amount_subtotal\": 3000,\n      \"amount_total\": 3000,\n      \"automatic_tax\": {\n        \"enabled\": false,\n        \"liability\": null,\n        \"provider\": null,\n        \"status\": null\n      },\n      \"billing_address_collection\": null,\n      \"branding_settings\": {\n        \"background_color\": \"#ffffff\",\n        \"border_style\": \"rounded\",\n        \"button_color\": \"#0074d4\",\n        \"display_name\": \"OPRaying Studio 沙盒\",\n        \"font_family\": \"default\",\n        \"icon\": null,\n        \"logo\": null\n      },\n      \"cancel_url\": \"https://httpbin.org/post\",\n      \"client_reference_id\": null,\n      \"client_secret\": null,\n      \"collected_information\": null,\n      \"consent\": null,\n      \"consent_collection\": null,\n      \"created\": 1776769139,\n      \"currency\": \"usd\",\n      \"currency_conversion\": null,\n      \"custom_fields\": [],\n      \"custom_text\": {\n        \"after_submit\": null,\n        \"shipping_address\": null,\n        \"submit\": null,\n        \"terms_of_service_acceptance\": null\n      },\n      \"customer\": null,\n      \"customer_account\": null,\n      \"customer_creation\": \"if_required\",\n      \"customer_details\": {\n        \"address\": {\n          \"city\": \"South San Francisco\",\n          \"country\": \"US\",\n          \"line1\": \"354 Oyster Point Blvd\",\n          \"line2\": null,\n          \"postal_code\": \"94080\",\n          \"state\": \"CA\"\n        },\n        \"business_name\": null,\n        \"email\": \"stripe@example.com\",\n        \"individual_name\": null,\n        \"name\": \"Jenny Rosen\",\n        \"phone\": null,\n        \"tax_exempt\": \"none\",\n        \"tax_ids\": []\n      },\n      \"customer_email\": null,\n      \"discounts\": [],\n      \"expires_at\": 1776855538,\n      \"integration_identifier\": null,\n      \"invoice\": null,\n      \"invoice_creation\": {\n        \"enabled\": false,\n        \"invoice_data\": {\n          \"account_tax_ids\": null,\n          \"custom_fields\": null,\n          \"description\": null,\n          \"footer\": null,\n          \"issuer\": null,\n          \"metadata\": {},\n          \"rendering_options\": null\n        }\n      },\n      \"livemode\": false,\n      \"locale\": null,\n      \"managed_payments\": {\n        \"enabled\": false\n      },\n      \"metadata\": {},\n      \"mode\": \"payment\",\n      \"origin_context\": null,\n      \"payment_intent\": \"pi_3TOc1CJzxxJFDrzx0wUyORVJ\",\n      \"payment_link\": null,\n      \"payment_method_collection\": \"if_required\",\n      \"payment_method_configuration_details\": {\n        \"id\": \"pmc_1TOaNQJzxxJFDrzxCHQtXPbM\",\n        \"parent\": null\n      },\n      \"payment_method_options\": {\n        \"card\": {\n          \"request_three_d_secure\": \"automatic\"\n        }\n      },\n      \"payment_method_types\": [\n        \"card\",\n        \"link\"\n      ],\n      \"payment_status\": \"paid\",\n      \"permissions\": null,\n      \"phone_number_collection\": {\n        \"enabled\": false\n      },\n      \"recovered_from\": null,\n      \"saved_payment_method_options\": null,\n      \"setup_intent\": null,\n      \"shipping_address_collection\": null,\n      \"shipping_cost\": null,\n      \"shipping_options\": [],\n      \"status\": \"complete\",\n      \"submit_type\": null,\n      \"subscription\": null,\n      \"success_url\": \"https://httpbin.org/post\",\n      \"total_details\": {\n        \"amount_discount\": 0,\n        \"amount_shipping\": 0,\n        \"amount_tax\": 0\n      },\n      \"ui_mode\": \"hosted_page\",\n      \"url\": null,\n      \"wallet_options\": null\n    }\n  },\n  \"livemode\": false,\n  \"pending_webhooks\": 2,\n  \"request\": {\n    \"id\": null,\n    \"idempotency_key\": null\n  },\n  \"type\": \"checkout.session.completed\"\n}",
  "webhookSecret": "whsec_a797eac79700a35a660c541fc39489e0435887066cd6fba5719d9afeac2624f8",
  "source": "stripe-cli",
  "eventType": "checkout.session.completed",
  "capturedAt": "2026-04-21T10:59:03.535Z"
}
