packages/purchase/test/provider/fixtures/generated/stripe/invoice.payment_failed.json

{
  "payload": "{\n  \"id\": \"evt_1TOc2RJzxxJFDrzxjQiLsA6G\",\n  \"object\": \"event\",\n  \"api_version\": \"2026-03-25.dahlia\",\n  \"created\": 1776769219,\n  \"data\": {\n    \"object\": {\n      \"id\": \"in_1TOc2NJzxxJFDrzxCkpPCOXj\",\n      \"object\": \"invoice\",\n      \"account_country\": \"HK\",\n      \"account_name\": \"OPRaying Studio 沙盒\",\n      \"account_tax_ids\": null,\n      \"amount_due\": 2000,\n      \"amount_overpaid\": 0,\n      \"amount_paid\": 0,\n      \"amount_remaining\": 2000,\n      \"amount_shipping\": 0,\n      \"application\": null,\n      \"attempt_count\": 1,\n      \"attempted\": true,\n      \"auto_advance\": false,\n      \"automatic_tax\": {\n        \"disabled_reason\": null,\n        \"enabled\": false,\n        \"liability\": null,\n        \"provider\": null,\n        \"status\": null\n      },\n      \"automatically_finalizes_at\": null,\n      \"billing_reason\": \"manual\",\n      \"collection_method\": \"charge_automatically\",\n      \"created\": 1776769215,\n      \"currency\": \"usd\",\n      \"custom_fields\": null,\n      \"customer\": \"cus_UNMlLS9sssVy41\",\n      \"customer_account\": null,\n      \"customer_address\": null,\n      \"customer_email\": null,\n      \"customer_name\": null,\n      \"customer_phone\": null,\n      \"customer_shipping\": null,\n      \"customer_tax_exempt\": \"none\",\n      \"customer_tax_ids\": [],\n      \"default_payment_method\": null,\n      \"default_source\": null,\n      \"default_tax_rates\": [],\n      \"description\": \"(created by Stripe CLI)\",\n      \"discounts\": [],\n      \"due_date\": null,\n      \"effective_at\": 1776769216,\n      \"ending_balance\": 0,\n      \"footer\": null,\n      \"from_invoice\": null,\n      \"hosted_invoice_url\": \"https://invoice.stripe.com/i/acct_1TOaMsJzxxJFDrzx/test_YWNjdF8xVE9hTXNKenh4SkZEcnp4LF9VTk1sa2FpMkFuME5lcWhoNUdEdEJBU0R3OWpxVXRULDE2NzMxMDAxOQ0200p3TMWPrU?s=ap\",\n      \"invoice_pdf\": \"https://pay.stripe.com/invoice/acct_1TOaMsJzxxJFDrzx/test_YWNjdF8xVE9hTXNKenh4SkZEcnp4LF9VTk1sa2FpMkFuME5lcWhoNUdEdEJBU0R3OWpxVXRULDE2NzMxMDAxOQ0200p3TMWPrU/pdf?s=ap\",\n      \"issuer\": {\n        \"type\": \"self\"\n      },\n      \"last_finalization_error\": null,\n      \"latest_revision\": null,\n      \"lines\": {\n        \"object\": \"list\",\n        \"data\": [\n          {\n            \"id\": \"il_1TOc2NJzxxJFDrzxK8VopeQh\",\n            \"object\": \"line_item\",\n            \"amount\": 2000,\n            \"currency\": \"usd\",\n            \"description\": \"(created by Stripe CLI)\",\n            \"discount_amounts\": [],\n            \"discountable\": true,\n            \"discounts\": [],\n            \"invoice\": \"in_1TOc2NJzxxJFDrzxCkpPCOXj\",\n            \"livemode\": false,\n            \"metadata\": {},\n            \"parent\": {\n              \"invoice_item_details\": {\n                \"invoice_item\": \"ii_1TOc2NJzxxJFDrzxYQL07IWz\",\n                \"proration\": false,\n                \"proration_details\": {\n                  \"credited_items\": null\n                },\n                \"subscription\": null\n              },\n              \"subscription_item_details\": null,\n              \"type\": \"invoice_item_details\"\n            },\n            \"period\": {\n              \"end\": 1776769215,\n              \"start\": 1776769215\n            },\n            \"pretax_credit_amounts\": [],\n            \"pricing\": {\n              \"price_details\": {\n                \"price\": \"price_1TOafUJzxxJFDrzxgvJgTq8M\",\n                \"product\": \"prod_UNLMO4NB9D8GTP\"\n              },\n              \"type\": \"price_details\",\n              \"unit_amount_decimal\": \"2000\"\n            },\n            \"quantity\": 1,\n            \"quantity_decimal\": \"1\",\n            \"subtotal\": 2000,\n            \"taxes\": []\n          }\n        ],\n        \"has_more\": false,\n        \"total_count\": 1,\n        \"url\": \"/v1/invoices/in_1TOc2NJzxxJFDrzxCkpPCOXj/lines\"\n      },\n      \"livemode\": false,\n      \"metadata\": {},\n      \"next_payment_attempt\": null,\n      \"number\": \"EGZ5HGP6-0001\",\n      \"on_behalf_of\": null,\n      \"parent\": null,\n      \"payment_settings\": {\n        \"default_mandate\": null,\n        \"payment_method_options\": null,\n        \"payment_method_types\": null\n      },\n      \"period_end\": 1776769215,\n      \"period_start\": 1776769215,\n      \"post_payment_credit_notes_amount\": 0,\n      \"pre_payment_credit_notes_amount\": 0,\n      \"receipt_number\": null,\n      \"rendering\": {\n        \"amount_tax_display\": null,\n        \"pdf\": {\n          \"page_size\": \"letter\"\n        },\n        \"template\": null,\n        \"template_version\": null\n      },\n      \"shipping_cost\": null,\n      \"shipping_details\": null,\n      \"starting_balance\": 0,\n      \"statement_descriptor\": null,\n      \"status\": \"open\",\n      \"status_transitions\": {\n        \"finalized_at\": 1776769216,\n        \"marked_uncollectible_at\": null,\n        \"paid_at\": null,\n        \"voided_at\": null\n      },\n      \"subtotal\": 2000,\n      \"subtotal_excluding_tax\": 2000,\n      \"test_clock\": null,\n      \"total\": 2000,\n      \"total_discount_amounts\": [],\n      \"total_excluding_tax\": 2000,\n      \"total_pretax_credit_amounts\": [],\n      \"total_taxes\": [],\n      \"webhooks_delivered_at\": 1776769216\n    }\n  },\n  \"livemode\": false,\n  \"pending_webhooks\": 2,\n  \"request\": {\n    \"id\": \"req_5IOXh4JWZlg80Y\",\n    \"idempotency_key\": \"e18874a9-c624-4453-b2b6-b839f3d2a234\"\n  },\n  \"type\": \"invoice.payment_failed\"\n}",
  "webhookSecret": "whsec_a797eac79700a35a660c541fc39489e0435887066cd6fba5719d9afeac2624f8",
  "source": "stripe-cli",
  "eventType": "invoice.payment_failed",
  "capturedAt": "2026-04-21T11:00:20.272Z"
}
